In [1]:
import numpy as np
import pandas as pd
import os
# import matplotlib.pyplot as plt
# %matplotlib inline

In [2]:
titanic_train = pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv",
                           sep='\t')   
# titanic_train

In [3]:
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
titanic_train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,156.000000,156.000000,156.000000,126.000000,156.000000,156.000000,156.000000
mean,78.500000,0.346154,2.423077,28.141508,0.615385,0.397436,28.109587
std,45.177428,0.477275,0.795459,14.613880,1.056235,0.870146,39.401047
min,1.000000,0.000000,1.000000,0.830000,0.000000,0.000000,6.750000
25%,39.750000,0.000000,2.000000,19.000000,0.000000,0.000000,8.003150
50%,78.500000,0.000000,3.000000,26.000000,0.000000,0.000000,14.454200
75%,117.250000,1.000000,3.000000,35.000000,1.000000,0.000000,30.371850
max,156.000000,1.000000,3.000000,71.000000,5.000000,5.000000,263.000000

In [5]:
titanic_train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [6]:
titanic_train.dtypes == "object"
a = titanic_train.dtypes[titanic_train.dtypes == "object"].index
a
titanic_train[a].describe()

                       Name   Sex Ticket        Cabin Embarked
count                   156   156    156           31      155
unique                  156     2    145           28        3
top     Kraeff, Mr. Theodor  male  11668  C23 C25 C27        S
freq                      1   100      2            2      110

In [7]:
a = titanic_train.dtypes[titanic_train.dtypes == "object"].index

In [8]:
titanic_train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,156.000000,156.000000,156.000000,126.000000,156.000000,156.000000,156.000000
mean,78.500000,0.346154,2.423077,28.141508,0.615385,0.397436,28.109587
std,45.177428,0.477275,0.795459,14.613880,1.056235,0.870146,39.401047
min,1.000000,0.000000,1.000000,0.830000,0.000000,0.000000,6.750000
25%,39.750000,0.000000,2.000000,19.000000,0.000000,0.000000,8.003150
50%,78.500000,0.000000,3.000000,26.000000,0.000000,0.000000,14.454200
75%,117.250000,1.000000,3.000000,35.000000,1.000000,0.000000,30.371850
max,156.000000,1.000000,3.000000,71.000000,5.000000,5.000000,263.000000

In [9]:
titanic_train.dtypes[titanic_train.dtypes == "object"].index

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [10]:
titanic_train.dtypes[titanic_train.dtypes == "object"]


titanic_train.dtypes[titanic_train.dtypes == "object"].index

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [11]:
titanic_train.dtypes[titanic_train.dtypes == "object"]

Name        object
Sex         object
Ticket      object
Cabin       object
Embarked    object
dtype: object

In [12]:
list_col = titanic_train.dtypes[titanic_train.dtypes == "object"].index
titanic_train[list_col].describe()

                       Name   Sex Ticket        Cabin Embarked
count                   156   156    156           31      155
unique                  156     2    145           28        3
top     Kraeff, Mr. Theodor  male  11668  C23 C25 C27        S
freq                      1   100      2            2      110

In [13]:
titanic_train[['Name','Sex','Ticket', 'Cabin', 'Embarked']].describe()

                       Name   Sex Ticket        Cabin Embarked
count                   156   156    156           31      155
unique                  156     2    145           28        3
top     Kraeff, Mr. Theodor  male  11668  C23 C25 C27        S
freq                      1   100      2            2      110

In [14]:
sorted(titanic_train["Name"])[0:15] # Check the first 15 sorted names

['Ahlin, Mrs. Johan (Johanna Persdotter Larsson)',
 'Allen, Mr. William Henry',
 'Andersson, Miss. Ellis Anna Maria',
 'Andersson, Miss. Erna Alexandra',
 'Andersson, Mr. Anders Johan',
 'Andersson, Mr. August Edvard ("Wennerstrom")',
 'Andreasson, Mr. Paul Edvin',
 'Andrew, Mr. Edgardo Samuel',
 'Arnold-Franchi, Mrs. Josef (Josefine Franchi)',
 'Asplund, Mrs. Carl Oscar (Selma Augusta Emilia Johansson)',
 'Attalah, Miss. Malake',
 'Backstrom, Mrs. Karl Alfred (Maria Mathilda Gustafsson)',
 'Barton, Mr. David John',
 'Bateman, Rev. Robert James',
 'Baxter, Mr. Quigg Edmond']

In [15]:
titanic_train["Name"].describe()

count                     156
unique                    156
top       Kraeff, Mr. Theodor
freq                        1
Name: Name, dtype: object

In [16]:
titanic_train[["Ticket"]][4:9]

   Ticket
4  373450
5  330877
6   17463
7  349909
8  347742

In [17]:
# titanic_train["Ticket"].describe()
titanic_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [18]:
titanic_train["Manoj"]="sdffs"
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Manoj
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,sdffs
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,sdffs
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,sdffs
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,sdffs
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,sdffs

In [19]:
titanic_train["Cabin"][0:15]       # Check the first 15 tickets

0      NaN
1      C85
2      NaN
3     C123
4      NaN
5      NaN
6      E46
7      NaN
8      NaN
9      NaN
10      G6
11    C103
12     NaN
13     NaN
14     NaN
Name: Cabin, dtype: object

In [20]:
titanic_train.dtypes# Check number of unique cabins

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
Manoj           object
dtype: object

In [21]:
pd.Categorical(titanic_train['Survived'])

[0, 1, 1, 1, 0, ..., 1, 0, 0, 0, 0]
Length: 156
Categories (2, int64): [0, 1]

In [22]:
new_sur = pd.Categorical(titanic_train['Survived'])
new_sur = new_sur.rename_categories(['Died','Survived'])
new_sur

[Died, Survived, Survived, Survived, Died, ..., Survived, Died, Died, Died, Died]
Length: 156
Categories (2, object): [Died, Survived]

In [23]:
titanic_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'Manoj'],
      dtype='object')

In [24]:
titanic_train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,156.000000,156.000000,156.000000,126.000000,156.000000,156.000000,156.000000
mean,78.500000,0.346154,2.423077,28.141508,0.615385,0.397436,28.109587
std,45.177428,0.477275,0.795459,14.613880,1.056235,0.870146,39.401047
min,1.000000,0.000000,1.000000,0.830000,0.000000,0.000000,6.750000
25%,39.750000,0.000000,2.000000,19.000000,0.000000,0.000000,8.003150
50%,78.500000,0.000000,3.000000,26.000000,0.000000,0.000000,14.454200
75%,117.250000,1.000000,3.000000,35.000000,1.000000,0.000000,30.371850
max,156.000000,1.000000,3.000000,71.000000,5.000000,5.000000,263.000000

In [25]:
new_Pclass = pd.Categorical(titanic_train["Pclass"])
# type(new_Pclass)

In [26]:
new_Pclass = pd.Categorical(titanic_train["Pclass"])

new_Pclass = new_Pclass.rename_categories(['Class1','Class2','Class3'])
type(new_Pclass)

pandas.core.arrays.categorical.Categorical

In [27]:
new_Pclass = pd.Categorical(titanic_train["Pclass"])
new_Pclass

[3, 1, 3, 1, 3, ..., 1, 3, 3, 3, 1]
Length: 156
Categories (3, int64): [1, 2, 3]

In [28]:
titanic_train['Pclass1'] = new_Pclass
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Manoj,Pclass1
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,sdffs,3
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,sdffs,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,sdffs,3
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,sdffs,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,sdffs,3

In [29]:
new_Pclass.describe()

            counts     freqs
categories
1               30  0.192308
2               30  0.192308
3               96  0.615385

In [30]:
titanic_train["Cabin"].unique()   # Check unique cabins

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2'], dtype=object)

In [31]:
titanic_train["Cabin"].astype(str)

0       nan
1       C85
2       nan
3      C123
4       nan
       ...
151      C2
152     nan
153     nan
154     nan
155     nan
Name: Cabin, Length: 156, dtype: object

In [32]:
import numpy as np 
char_cabin = titanic_train["Cabin"].astype(str) # Convert data to str

new_Cabin = [cabin[0] for cabin in char_cabin] # Take first letter

new_Cabin = pd.Categorical(new_Cabin)
# new_Cabin
new_Cabin.describe()

            counts     freqs
categories
A                2  0.012821
B                5  0.032051
C               10  0.064103
D                6  0.038462
E                3  0.019231
F                4  0.025641
G                1  0.006410
n              125  0.801282

In [33]:
titanic_train["Cabin"] = new_Cabin
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Manoj,Pclass1
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,n,S,sdffs,3
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,C,sdffs,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,n,S,sdffs,3
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C,S,sdffs,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,n,S,sdffs,3

In [34]:
dummy_vector = pd.Series([1,None,3,None,7,8])
dummy_vector
dummy_vector.isnull()

0    False
1     True
2    False
3     True
4    False
5    False
dtype: bool

In [35]:
type(dummy_vector)

pandas.core.series.Series

In [36]:
# titanic_train["Age"].isnull()

In [37]:
np.where(titanic_train["Age"].isnull() == True)

(array([  5,  17,  19,  26,  28,  29,  31,  32,  36,  42,  45,  46,  47,
         48,  55,  64,  65,  76,  77,  82,  87,  95, 101, 107, 109, 121,
        126, 128, 140, 154], dtype=int64),)

In [38]:
missing = np.where(titanic_train["Age"].isnull() == True)
missing

(array([  5,  17,  19,  26,  28,  29,  31,  32,  36,  42,  45,  46,  47,
         48,  55,  64,  65,  76,  77,  82,  87,  95, 101, 107, 109, 121,
        126, 128, 140, 154], dtype=int64),)

In [39]:
type(missing)

tuple

In [40]:
titanic_train.loc[missing]['Name']

5                                    Moran, Mr. James
17                       Williams, Mr. Charles Eugene
19                            Masselmani, Mrs. Fatima
26                            Emir, Mr. Farred Chehab
28                      O'Dwyer, Miss. Ellen "Nellie"
29                                Todoroff, Mr. Lalio
31     Spencer, Mrs. William Augustus (Marie Eugenie)
32                           Glynn, Miss. Mary Agatha
36                                   Mamee, Mr. Hanna
42                                Kraeff, Mr. Theodor
45                           Rogers, Mr. William John
46                                  Lennon, Mr. Denis
47                          O'Driscoll, Miss. Bridget
48                                Samaan, Mr. Youssef
55                                  Woolner, Mr. Hugh
64                              Stewart, Mr. Albert A
65                           Moubarek, Master. Gerios
76                                  Staneff, Mr. Ivan
77                           Moutal, Mr. Rahamin Haim
82                     McDermott, Miss. Brigdet Delia
87                      Slocovski, Mr. Selman Francis
95                        Shorney, Mr. Charles Joseph
101                  Petroff, Mr. Pastcho ("Pentcho")
107                            Moss, Mr. Albert Johan
109                               Moran, Miss. Bertha
121                        Moore, Mr. Leonard Charles
126                               McMahon, Mr. Martin
128                                 Peter, Miss. Anna
140                     Boulos, Mrs. Joseph (Sultana)
154                             Olsen, Mr. Ole Martin
Name: Name, dtype: object

In [41]:
titanic_train["Fare"].head()

0     7.2500
1    71.2833
2     7.9250
3    53.1000
4     8.0500
Name: Fare, dtype: float64

In [42]:
index =np.where(titanic_train["Fare"]==max(titanic_train["Fare"]))
# titanic_train.loc[index]['Name']
index

(array([27, 88], dtype=int64),)

In [43]:
# max(titanic_train["Fare"])

In [44]:
# index

In [45]:
titanic_train.loc[np.where(titanic_train["Fare"]==max(titanic_train["Fare"]))]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Manoj,Pclass1
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0,C,S,sdffs,1
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0,C,S,sdffs,1

In [46]:
titanic_train.iloc[index]['Name']

27    Fortune, Mr. Charles Alexander
88        Fortune, Miss. Mabel Helen
Name: Name, dtype: object

In [47]:
len(missing[0])

30

In [48]:
titanic_train["Family"] = titanic_train["SibSp"] + titanic_train["Parch"]
# titanic_train["Family"]
most_family = np.where(titanic_train["Family"] == max(titanic_train["Family"]))
most_family
# titanic_train.head()

(array([59, 71], dtype=int64),)

In [49]:
titanic_train["Family"] = titanic_train["SibSp"] + titanic_train["Parch"]

most_family = np.where(titanic_train["Family"] == max(titanic_train["Family"]))
most_family
titanic_train.iloc[most_family]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Manoj,Pclass1,Family
59,60,0,3,"Goodwin, Master. William Frederick",male,11.0,5,2,CA 2144,46.9,n,S,sdffs,3,7
71,72,0,3,"Goodwin, Miss. Lillian Amy",female,16.0,5,2,CA 2144,46.9,n,S,sdffs,3,7

In [50]:
# import numpy as np
# import pandas as pd

labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

print ("Labels:", labels)
print("My data:", my_data)
print("Dictionary:", d)
print("Array : ", arr)
# pd.Series(my_data, index=labels)

Labels: ['a', 'b', 'c']
My data: [10, 20, 30]
Dictionary: {'a': 10, 'b': 20, 'c': 30}
Array :  [10 20 30]

In [51]:
a

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [52]:
a[0:2]

Index(['Name', 'Sex'], dtype='object')

In [53]:
a = pd.Series(my_data,index = labels)

In [54]:
a["b"]

20

In [55]:
pd.Series(my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [56]:
print(pd.Series(arr))

0    10
1    20
2    30
dtype: int32

In [57]:
print ("\nHolding numerical data\n",'-'*25, sep='')
print(pd.Series(arr)[0])

Holding numerical data
-------------------------
10

In [58]:
print ("\nHolding text labels\n",'-'*20, sep='')
print(pd.Series(labels))

Holding text labels
--------------------
0    a
1    b
2    c
dtype: object

In [59]:
d = {'a':"kjhk",'b':20,'c':30}
# d.items
pd.DataFrame(d,index = ['e','f','g'])

      a   b   c
e  kjhk  20  30
f  kjhk  20  30
g  kjhk  20  30

In [60]:
print ("\nHolding objects from a dictionary\n",'-'*40, sep='')
print(pd.Series([type, sum, max]))

Holding objects from a dictionary
----------------------------------------
0             <class 'type'>
1    <built-in function sum>
2    <built-in function max>
dtype: object

In [61]:
ser1 = pd.Series([1,2,3,4],index = [2,4,6,8])
ser2 = pd.Series([1,2,5,4],['CA', 'OR', 'NV', 'AZ'])
ser1

2    1
4    2
6    3
8    4
dtype: int64

In [62]:
ser1 = pd.Series([1,2,3,4],['CA', 'OR', 'CO', 'CA'])
ser2 = pd.Series([1,2,5,4],['CA', 'NV', 'AZ','OR'])
ser3 = ser1+ser2
ser3

AZ    NaN
CA    2.0
CA    5.0
CO    NaN
NV    NaN
OR    6.0
dtype: float64

In [64]:
# ser1 = pd.Series(['a','b',1,'d'],['CA', 'OR', 'CO', 'CA'])
# ser2 = pd.Series(['a','b','c','d'],['CA', 'OR', 'CO', 'CA'])
# ser3 = ser1+ser2
# ser3

In [65]:
print ("\nIndexing by number (positional value in the series)\n",'-'*52, sep='')
print("Value for CA in ser1:", ser1[2])
print("Value for AZ in ser1:", ser1[4])
print("Value for NV in ser2:", ser2[2])
# ser1

Indexing by number (positional value in the series)
----------------------------------------------------
Value for CA in ser1: 1

IndexError: index out of bounds

In [66]:
print ("\nIndexing by a range\n",'-'*25, sep='')
print ("Value for OR, CO, and AZ in ser1:\n", ser1[0:3:2], sep='')

Indexing by a range
-------------------------
Value for OR, CO, and AZ in ser1:
CA    a
CO    1
dtype: object

In [67]:
ser1 = pd.Series([1,2,3,4],['CA', 'OR', 'CO', 'CA'])
ser2 = pd.Series([1,2,5,4],['CA', 'NV', 'AZ','OR'])
ser3 = ser1+ser2
ser3

AZ    NaN
CA    2.0
CA    5.0
CO    NaN
NV    NaN
OR    6.0
dtype: float64

In [68]:
# ser1['CA']

In [69]:
ser2

CA    1
NV    2
AZ    5
OR    4
dtype: int64

In [70]:
print ("\nAfter adding the two series, the result looks like this...\n",'-'*59, sep='')
print(ser3)
print("\nPython tries to add values where it finds common index name, and puts NaN where indices are missing\n")

After adding the two series, the result looks like this...
-----------------------------------------------------------
AZ    NaN
CA    2.0
CA    5.0
CO    NaN
NV    NaN
OR    6.0
dtype: float64

Python tries to add values where it finds common index name, and puts NaN where indices are missing

In [71]:
ser1

CA    1
OR    2
CO    3
CA    4
dtype: int64

In [72]:
ser2

CA    1
NV    2
AZ    5
OR    4
dtype: int64

In [73]:
print ("\nThe idea works even for multiplication...\n",'-'*43, sep='')
print (ser1*ser2)

The idea works even for multiplication...
-------------------------------------------
AZ    NaN
CA    1.0
CA    4.0
CO    NaN
NV    NaN
OR    8.0
dtype: float64

In [74]:
import pandas as pd

In [75]:
import numpy as np
from numpy.random import randn as rn
np.random.seed()
matrix_data = rn(5,4)
row_labels = ['A','B','C','D','E']
column_headings = ['W','X','Y','Z']

df = pd.DataFrame(matrix_data,row_labels,column_headings)
print("\nThe data frame looks like\n",'-'*45, sep='')
df
# matrix_data

The data frame looks like
---------------------------------------------

          W         X         Y         Z
A  1.003268 -1.289695  2.108653  0.143949
B  0.611217 -0.457052  0.367504  0.793309
C -1.042836  1.699896 -1.846910  1.838638
D  1.032087 -0.185539 -0.309458 -0.413600
E -1.269891  0.360570  1.307455 -0.358013

In [76]:
df.iloc[0]

W    1.003268
X   -1.289695
Y    2.108653
Z    0.143949
Name: A, dtype: float64

In [77]:
type(df[['X']])

pandas.core.frame.DataFrame

In [78]:
# help(rn)

In [79]:
print("\nType of the pair of columns: ", type(df[['X','Z']]), sep='')
print ("\nSo, for more than one column, the object turns into a DataFrame")

Type of the pair of columns: <class 'pandas.core.frame.DataFrame'>

So, for more than one column, the object turns into a DataFrame

In [80]:
print("\nThe 'X' column accessed by DOT method (NOT recommended)\n",'-'*55, sep='')
print(df["X"])

The 'X' column accessed by DOT method (NOT recommended)
-------------------------------------------------------
A   -1.289695
B   -0.457052
C    1.699896
D   -0.185539
E    0.360570
Name: X, dtype: float64

In [81]:
print("\nA column is created by assigning it in relation to an existing column\n",'-'*75, sep='')
df['New'] = df['X']+df['Z']
df['New (Sum of X and Z)'] = df['X']+df['Z']
print(df)

A column is created by assigning it in relation to an existing column
---------------------------------------------------------------------------
          W         X         Y         Z       New  New (Sum of X and Z)
A  1.003268 -1.289695  2.108653  0.143949 -1.145746             -1.145746
B  0.611217 -0.457052  0.367504  0.793309  0.336257              0.336257
C -1.042836  1.699896 -1.846910  1.838638  3.538534              3.538534
D  1.032087 -0.185539 -0.309458 -0.413600 -0.599139             -0.599139
E -1.269891  0.360570  1.307455 -0.358013  0.002557              0.002557

In [82]:
df

          W         X         Y         Z       New  New (Sum of X and Z)
A  1.003268 -1.289695  2.108653  0.143949 -1.145746             -1.145746
B  0.611217 -0.457052  0.367504  0.793309  0.336257              0.336257
C -1.042836  1.699896 -1.846910  1.838638  3.538534              3.538534
D  1.032087 -0.185539 -0.309458 -0.413600 -0.599139             -0.599139
E -1.269891  0.360570  1.307455 -0.358013  0.002557              0.002557

In [83]:
print("\nA column is dropped by using df.drop() method\n",'-'*55, sep=' ')
df.drop("C",inplace=True) # Notice the axis=1 option, axis = 0 is default, so one has to change it to 1

A column is dropped by using df.drop() method
 -------------------------------------------------------

In [84]:
df

          W         X         Y         Z       New  New (Sum of X and Z)
A  1.003268 -1.289695  2.108653  0.143949 -1.145746             -1.145746
B  0.611217 -0.457052  0.367504  0.793309  0.336257              0.336257
D  1.032087 -0.185539 -0.309458 -0.413600 -0.599139             -0.599139
E -1.269891  0.360570  1.307455 -0.358013  0.002557              0.002557

In [85]:
df1=df.drop('A')
print("\nA row (index) is dropped by using df.drop() method and axis=0\n",'-'*65, sep='')
print(df1)

A row (index) is dropped by using df.drop() method and axis=0
-----------------------------------------------------------------
          W         X         Y         Z       New  New (Sum of X and Z)
B  0.611217 -0.457052  0.367504  0.793309  0.336257              0.336257
D  1.032087 -0.185539 -0.309458 -0.413600 -0.599139             -0.599139
E -1.269891  0.360570  1.307455 -0.358013  0.002557              0.002557

In [86]:
df1

          W         X         Y         Z       New  New (Sum of X and Z)
B  0.611217 -0.457052  0.367504  0.793309  0.336257              0.336257
D  1.032087 -0.185539 -0.309458 -0.413600 -0.599139             -0.599139
E -1.269891  0.360570  1.307455 -0.358013  0.002557              0.002557

In [87]:
print("\nAn in-place change can be done by making inplace=True in the drop method\n",'-'*75, sep='')
df.drop('New (Sum of X and Z)', axis=1, inplace=True)
print(df)

An in-place change can be done by making inplace=True in the drop method
---------------------------------------------------------------------------
          W         X         Y         Z       New
A  1.003268 -1.289695  2.108653  0.143949 -1.145746
B  0.611217 -0.457052  0.367504  0.793309  0.336257
D  1.032087 -0.185539 -0.309458 -0.413600 -0.599139
E -1.269891  0.360570  1.307455 -0.358013  0.002557

In [88]:
### Selecting/indexing Rows
#* Label-based 'loc' method
#* Index (numeric) 'iloc' method
df

          W         X         Y         Z       New
A  1.003268 -1.289695  2.108653  0.143949 -1.145746
B  0.611217 -0.457052  0.367504  0.793309  0.336257
D  1.032087 -0.185539 -0.309458 -0.413600 -0.599139
E -1.269891  0.360570  1.307455 -0.358013  0.002557

In [89]:
print("\nLabel-based 'loc' method can be used for selecting row(s)\n",'-'*60, sep='')
print("\nSingle row\n")
print(df.iloc[3])

Label-based 'loc' method can be used for selecting row(s)
------------------------------------------------------------

Single row

W     -1.269891
X      0.360570
Y      1.307455
Z     -0.358013
New    0.002557
Name: E, dtype: float64

In [93]:
print("\nIndex position based 'iloc' method can be used for selecting row(s)\n",'-'*70, sep='')
print("\nSingle row\n")
print(df.iloc[2])

Index position based 'iloc' method can be used for selecting row(s)
----------------------------------------------------------------------

Single row

W      1.032087
X     -0.185539
Y     -0.309458
Z     -0.413600
New   -0.599139
Name: D, dtype: float64

In [94]:
print("\nMultiple rows\n")
print(df.iloc[[1,2]])

Multiple rows

          W         X         Y         Z       New
B  0.611217 -0.457052  0.367504  0.793309  0.336257
D  1.032087 -0.185539 -0.309458 -0.413600 -0.599139

In [95]:
#### Subsetting DataFrame

In [96]:

matrix_data = rn(5,4)
row_labels = ['A','B','C','D','E']
column_headings = ['W','X','Y','Z']
df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)

In [97]:
print("\nThe DatFrame\n",'-'*45, sep='')
print(df)

The DatFrame
---------------------------------------------
          W         X         Y         Z
A -0.836498  0.260063  0.437579  1.371711
B -1.677137  0.439878 -0.202295  0.031342
C -1.511421 -0.023139  0.522734 -0.342271
D -1.007834  0.000749  1.046082  0.268094
E  0.334843 -2.268866 -1.905481 -1.518008

In [98]:
print("\nElement at row 'B' and column 'Y' is\n") 
print(df.loc[['B','C'],['Y','W']])

Element at row 'B' and column 'Y' is

          Y         W
B -0.202295 -1.677137
C  0.522734 -1.511421

In [99]:
print("\nSubset comprising of rows B and D, and columns W and Y, is\n")
df.iloc[[1,2,3],[0,1]]

Subset comprising of rows B and D, and columns W and Y, is

          W         X
B -1.677137  0.439878
C -1.511421 -0.023139
D -1.007834  0.000749

In [100]:
print(df.loc[['B','C'],])

          W         X         Y         Z
B -1.677137  0.439878 -0.202295  0.031342
C -1.511421 -0.023139  0.522734 -0.342271

In [101]:
print("\nThe DataFrame\n",'-'*45, sep='')
print(df)

The DataFrame
---------------------------------------------
          W         X         Y         Z
A -0.836498  0.260063  0.437579  1.371711
B -1.677137  0.439878 -0.202295  0.031342
C -1.511421 -0.023139  0.522734 -0.342271
D -1.007834  0.000749  1.046082  0.268094
E  0.334843 -2.268866 -1.905481 -1.518008

In [102]:
print("\nBoolean DataFrame(s) where we are checking if the values are greater than 0\n",'-'*75, sep='')
print(df>0)

Boolean DataFrame(s) where we are checking if the values are greater than 0
---------------------------------------------------------------------------
       W      X      Y      Z
A  False   True   True   True
B  False   True  False   True
C  False  False   True  False
D  False   True   True   True
E   True  False  False  False

In [103]:
print("\n")
print(df.loc[['A','B','C']]>0)

       W      X      Y      Z
A  False   True   True   True
B  False   True  False   True
C  False  False   True  False

In [104]:
booldf = df>0
print("\nDataFrame indexed by boolean dataframe\n",'-'*45, sep='')
print(df[booldf])

DataFrame indexed by boolean dataframe
---------------------------------------------
          W         X         Y         Z
A       NaN  0.260063  0.437579  1.371711
B       NaN  0.439878       NaN  0.031342
C       NaN       NaN  0.522734       NaN
D       NaN  0.000749  1.046082  0.268094
E  0.334843       NaN       NaN       NaN

In [105]:

# import pandas as pd 
# import numpy as np
matrix_data = np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,152')
row_labels = ['A','B','C','D','E']
column_headings = ['Age', 'Height', 'Weight']
matrix_data.size

15

In [106]:
df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)
print("\nA new DataFrame\n",'-'*25, sep='')
print(df)

A new DataFrame
-------------------------
   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

In [107]:
df[df['Height']>65]

   Age  Height  Weight
A   22      66     140
B   42      70     148
D   35      68     160

In [108]:
df['Height']>65

A     True
B     True
C    False
D     True
E    False
Name: Height, dtype: bool

In [109]:
print("\nRows with Height > 65 inch\n",'-'*35, sep='')
print(df[df['Height']>65])

Rows with Height > 65 inch
-----------------------------------
   Age  Height  Weight
A   22      66     140
B   42      70     148
D   35      68     160

In [110]:
df['Height']>65

A     True
B     True
C    False
D     True
E    False
Name: Height, dtype: bool

In [111]:
booldf1 = df['Height']>65
booldf2 = df['Weight']>145

In [112]:
print("\nRows with Height > 65 inch and Weight >145 lbs\n",'-'*55, sep='')
print(df[(booldf1) & (booldf2)])

Rows with Height > 65 inch and Weight >145 lbs
-------------------------------------------------------
   Age  Height  Weight
B   42      70     148
D   35      68     160

In [113]:
print("\nDataFrame with only Age and Weight columns whose Height > 65 inch\n",'-'*68, sep='')
print(df[booldf1][['Age','Weight']])

DataFrame with only Age and Weight columns whose Height > 65 inch
--------------------------------------------------------------------
   Age  Weight
A   22     140
B   42     148
D   35     160

In [114]:
matrix_data = np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,152')
row_labels = ['A','B','C','D','E']
column_headings = ['Age', 'Height', 'Weight']

In [115]:
df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)
print("\nThe DataFrame\n",'-'*25, sep='')
print(df)

The DataFrame
-------------------------
   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

In [116]:
print("\nAfter resetting index\n",'-'*35, sep='')
print(df.reset_index())

After resetting index
-----------------------------------
  index  Age  Height  Weight
0     A   22      66     140
1     B   42      70     148
2     C   30      62     125
3     D   35      68     160
4     E   25      62     152

In [117]:
print("\nAfter resetting index with 'drop' option TRUE\n",'-'*45, sep='')
print(df.reset_index(drop=True))
"Student Teacher Engineer Doctor Nurse".split()

After resetting index with 'drop' option TRUE
---------------------------------------------
   Age  Height  Weight
0   22      66     140
1   42      70     148
2   30      62     125
3   35      68     160
4   25      62     152

['Student', 'Teacher', 'Engineer', 'Doctor', 'Nurse']

In [118]:
print("\nAdding a new column 'Profession'\n",'-'*45, sep='')
df['Profession'] = "Student Teacher Engineer Doctor Nurse".split()
print(df)

Adding a new column 'Profession'
---------------------------------------------
   Age  Height  Weight Profession
A   22      66     140    Student
B   42      70     148    Teacher
C   30      62     125   Engineer
D   35      68     160     Doctor
E   25      62     152      Nurse

In [119]:
print("\nSetting 'Profession' column as index\n",'-'*45, sep='')
print (df.set_index('Profession'))

Setting 'Profession' column as index
---------------------------------------------
            Age  Height  Weight
Profession
Student      22      66     140
Teacher      42      70     148
Engineer     30      62     125
Doctor       35      68     160
Nurse        25      62     152

In [120]:
#multi-indexing
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))

In [121]:
print("\nTuple pairs after the zip and list command\n",'-'*45, sep='')
print(hier_index)

Tuple pairs after the zip and list command
---------------------------------------------
[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [122]:
hier_index = pd.MultiIndex.from_tuples(hier_index)
print("\nIndex hierarchy\n",'-'*25, sep='')
print(hier_index)

Index hierarchy
-------------------------
MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [123]:
print("\nIndex hierarchy type\n",'-'*25, sep='')
print(type(hier_index))

Index hierarchy type
-------------------------
<class 'pandas.core.indexes.multi.MultiIndex'>

In [124]:
print("\nCreating DataFrame with multi-index\n",'-'*37, sep='')
#np.random.seed(101)
df1 = pd.DataFrame(data=np.round(rn(6,3)), index= hier_index, columns= ['A','B','C'])
print(df1)

Creating DataFrame with multi-index
-------------------------------------
        A    B    C
G1 1  1.0 -1.0  0.0
   2  0.0 -0.0 -1.0
   3  2.0  1.0 -1.0
G2 1 -1.0 -1.0  1.0
   2  0.0  2.0  0.0
   3 -2.0  0.0  1.0

In [125]:
#cross tabulation like pivot table

In [126]:
print("\nGrabbing a cross-section from outer level\n",'-'*45, sep='')
print(df1.xs('G1'))

Grabbing a cross-section from outer level
---------------------------------------------
     A    B    C
1  1.0 -1.0  0.0
2  0.0 -0.0 -1.0
3  2.0  1.0 -1.0